# Pivot‑Table Practice Lab (21 Questions)

Each question simulates a small DataFrame.  
**Your task:** create the requested pivot table (or tidy reshape) *below the simulation cell*.
Once you are finished, you can meet with your group. 

---

# Tidy Data Frame

A **tidy data frame** follows three simple rules:

1. **Each variable** is a column.  
2. **Each observation** (or case) is a row.  
3. **Each value** is a single cell.

For example, this is _tidy_:

| country | year | population |
| ------- | ---- | ---------- |
| A       | 2000 | 1,000,000  |
| A       | 2010 | 1,100,000  |
| B       | 2000 | 500,000    |
| B       | 2010 | 600,000    |


Here “country”, “year”, and “population” are each their own columns, and every row is one observation.

---

# Pivot Table

A **pivot table** is a way to **reshape** and **summarize** data:

- **Rows** and **columns** become grouping variables.  
- **Cell values** are computed by applying an aggregation (sum, mean, count, etc.) to the data in each group.

Using the same data, a pivot table showing population by country and year might look like:

| country | 2000      | 2010      |
| ------- | --------- | --------- |
| A       | 1,000,000 | 1,100,000 |
| B       | 500,000   | 600,000   |


Here we’ve “pivoted” the year values into separate columns and filled in the population.

---

# Wide vs. Long Format

- **Wide format**  
  - Variables that could be rows (e.g. “year”) become separate columns.  
  - Good for human‐readable tables or specific plotting functions.  

| country | pop\_2000 | pop\_2010 |
| ------- | --------- | --------- |
| A       | 1,000,000 | 1,100,000 |
| B       | 500,000   | 600,000   |


- **Long format**  
- Each row is one measurement; variable names live in a single column, with their values in another.  
- Ideal for most data‐analysis and plotting libraries (e.g., pandas “melt”).

| country | year | population |
| ------- | ---- | ---------- |
| A       | 2000 | 1,000,000  |
| A       | 2010 | 1,100,000  |
| B       | 2000 | 500,000    |
| B       | 2010 | 600,000    |

# Useful commands

In [3]:
import pandas as pd

# Sample long DataFrame
df = pd.DataFrame({
  'country': ['A','A','B','B'],
  'year':    [2000,2010,2000,2010],
  'population': [1_000_000,1_100_000,500_000,600_000]
})

In [4]:
# 1. Long → Wide with pivot (no aggregation)
df_wide = df.pivot(index='country', columns='year', values='population')

df_wide

year        2000     2010
country
A        1000000  1100000
B         500000   600000

In [5]:
# 2. Long → Wide with aggregation (sum, mean, etc.)
df_pt = df.pivot_table(
  index='country',
  columns='year',
  values='population',
  aggfunc='sum'
)

df_pt

year        2000     2010
country
A        1000000  1100000
B         500000   600000

In [6]:
# 3. Wide → Long with melt
df_wide_reset = df_wide.reset_index()  # bring 'country' back to a column
df_long = df_wide_reset.melt(
  id_vars='country',
  var_name='year',
  value_name='population'
)

df_long

  country  year  population
0       A  2000     1000000
1       B  2000      500000
2       A  2010     1100000
3       B  2010      600000

In [8]:
# 4. Tidying a more complex wide table
# Suppose you have separate year columns: pop_2000, pop_2010
df2 = pd.DataFrame({
  'country': ['A','B'],
  'pop_2000': [1_000_000, 500_000],
  'pop_2010': [1_100_000, 600_000]
})
df2_long = df2.melt(
  id_vars='country',
  value_vars=['pop_2000','pop_2010'],
  var_name='year',
  value_name='population'
)
# Clean up 'year' values
df2_long['year'] = df2_long['year'].str.replace('pop_','').astype(int)

df2_long

  country  year  population
0       A  2000     1000000
1       B  2000      500000
2       A  2010     1100000
3       B  2010      600000

## Question 1 — Region × Units Sold

Create a pivot table that shows **total units** sold in each region (i.e. region | units, use pd.pivot_table)

In [9]:
import pandas as pd, numpy as np
np.random.seed(0)
regions = ['North','South','East','West']
items = ['Widget']
df = pd.DataFrame({
    'region': np.random.choice(regions, size=20),
    'item': 'Widget',
    'units': np.random.randint(1, 11, 20)
})
df.head()

  region    item  units
0  North  Widget      7
1   West  Widget      8
2  South  Widget      8
3  North  Widget      9
4   West  Widget      2

<details><summary><strong>Show Solution</strong></summary>

```python
pd.pivot_table(df, index='region', values='units', aggfunc='sum')
```

</details>

## Question 2 — Average Temperature per City

Compute the **average temperature** for each city using a pivot table (use pivot_table)

In [12]:
np.random.seed(1)
cities = ['Boston','Chicago','Seattle']
dates = pd.date_range('2025-07-01', periods=15)
df = pd.DataFrame({
    'city': np.random.choice(cities, size=45),
    'date': np.tile(dates, 3),
    'temp_C': np.random.normal(25, 3, 45)
})
df.head()

      city       date     temp_C
0  Chicago 2025-07-01  26.601433
1   Boston 2025-07-02  24.724080
2   Boston 2025-07-03  30.741461
3  Chicago 2025-07-04  25.992391
4  Chicago 2025-07-05  28.425828

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='city', values='temp_C', aggfunc='mean')
```

</details>

## Question 3 — Count Students by Grade

Produce a pivot table counting how many students earned each grade.

In [14]:
np.random.seed(2)
grades = ['A','B','C','D']
df = pd.DataFrame({
    'student_id': range(1,51),
    'grade': np.random.choice(grades, 50)
})
df.head()

   student_id grade
0           1     A
1           2     D
2           3     B
3           4     A
4           5     C

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='grade', values='student_id', aggfunc='count')
```

</details>

## Question 4 — Quarterly Department Expenses

Pivot the table so **quarters become columns** and expenses fill values. Use pd.pivot.

In [17]:
np.random.seed(3)
depts = ['HR','IT','Sales']
quarters = ['Q1','Q2','Q3','Q4']
records = [(d,q,np.random.randint(5000,20000)) for d in depts for q in quarters]
df = pd.DataFrame(records, columns=['department','quarter','expense'])
df.head()

  department quarter  expense
0         HR      Q1    10994
1         HR      Q2     6688
2         HR      Q3    16513
3         HR      Q4    14859
4         IT      Q1    14160

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot(index='department', columns='quarter', values='expense')
```

</details>

## Question 5 — Wide‑to‑Long Patient BP

Melt the DataFrame to long form with columns: patient, day, bp.

In [18]:
np.random.seed(4)
df = pd.DataFrame({
    'patient':['P1','P2','P3'],
    'day1': np.random.randint(110,130,3),
    'day2': np.random.randint(110,130,3),
    'day3': np.random.randint(110,130,3)
})
df

<details><summary><strong>Show Solution</strong></summary>

```python
df_long = df.melt(id_vars='patient', var_name='day', value_name='bp')
```

</details>

## Question 6 — Mean Score by Class & Subject

Pivot to show **average score** per class (rows) and subject (columns).

In [19]:
np.random.seed(5)
classes = ['A','B']
subjects = ['Math','History','Science']
records=[(c,s,np.random.randint(50,101)) for c in classes for s in subjects for _ in range(5)]
df=pd.DataFrame(records, columns=['class','subject','score'])
df.head()

  class subject  score
0     A    Math     85
1     A    Math     64
2     A    Math     97
3     A    Math     88
4     A    Math     66

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='class', columns='subject', values='score', aggfunc='mean')
```

</details>

## Question 7 — Satisfaction Counts by Gender

Count satisfied vs not by gender (rows=gender, cols=satisfied).

In [22]:
np.random.seed(6)
df = pd.DataFrame({
    'gender': np.random.choice(['F','M'], 30),
    'satisfied': np.random.choice([0,1], 30)
})
df.head()

  gender  satisfied
0      F          1
1      M          0
2      M          1
3      F          1
4      F          0

<details><summary><strong>Show Solution</strong></summary>

```python
pd.pivot_table(df, index='gender', columns='satisfied', values='satisfied', aggfunc='count', fill_value=0)
```

</details>

## Question 8 — Handle Missing Units Before Pivot

Fill missing units with 0, then sum units per store×category.

In [24]:
np.random.seed(7)
df = pd.DataFrame({
    'store': np.random.choice(['A','B','C'], 15),
    'category': np.random.choice(['X','Y'], 15),
    'units': np.random.randint(1,20,15).astype(float)
})
# Introduce missing
df.loc[df.sample(5).index, 'units'] = np.nan
df.head()

  store category  units
0     A        Y   17.0
1     B        Y    NaN
2     C        X    NaN
3     A        X   10.0
4     B        Y   15.0

<details><summary><strong>Show Solution</strong></summary>

```python
df_filled = df.fillna({'units':0})
df_filled.pivot_table(index='store', columns='category', values='units', aggfunc='sum')
```

</details>

## Question 9 — Split Year‑Month Column

Split year_month into separate year and month columns, then pivot to show total sales by month (columns) for each year.

In [26]:
np.random.seed(8)
df = pd.DataFrame({
    'year_month': ['2025-01','2025-02','2025-01','2025-02'],
    'sales': np.random.randint(100,200,4)
})
df

  year_month  sales
0    2025-01    167
1    2025-02    184
2    2025-01    105
3    2025-02    190

<details><summary><strong>Show Solution</strong></summary>

```python
df[['year','month']] = df['year_month'].str.split('-', expand=True)
df.pivot_table(index='year', columns='month', values='sales', aggfunc='sum')
```

</details>

## Question 10 — Trim Whitespace Categories

Strip whitespace in 'team ' column, then average score per team.

In [28]:
np.random.seed(9)
df = pd.DataFrame({
    'team ': [' Red','Blue ',' Red','Blue '],
    'score': np.random.randint(10,30,4)
})
df

       score
team
Blue    14.5
Red     19.0

<details><summary><strong>Show Solution</strong></summary>

```python
df['team '] = df['team '].str.strip()
df.pivot_table(index='team ', values='score', aggfunc='mean')
```

</details>

## Question 11 — Duplicate Keys Needing Aggregation

Create a pivot table of **total revenue** per date with products as columns.

In [30]:
np.random.seed(10)
df = pd.DataFrame({
    'date': pd.date_range('2025-01-01', periods=6, freq='D').repeat(2),
    'product': ['A','B']*6,
    'revenue': np.random.randint(50,150,12)
})
df.head()

        date product  revenue
0 2025-01-01       A       59
1 2025-01-01       B       65
2 2025-01-02       A      114
3 2025-01-02       B       78
4 2025-01-03       A      139

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='date', columns='product', values='revenue', aggfunc='sum')
```

</details>

## Question 12 — Mean & Std in Same Pivot

Produce pivot with both mean and std of measure for each group.

In [32]:
np.random.seed(11)
df = pd.DataFrame({
    'group': np.random.choice(['G1','G2'], 30),
    'measure': np.random.normal(0,1,30)
})
df.head()

  group   measure
0    G2 -0.138082
1    G2  0.038107
2    G1 -0.348426
3    G2 -0.727205
4    G2  0.472204

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='group', values='measure', aggfunc=['mean','std'])
```

</details>

## Question 13 — Remove Duplicates Before Pivot

Keep only the latest status per id (keep first occurrence), then pivot status as columns and value as values.

In [34]:
np.random.seed(12)
df = pd.DataFrame({
    'id': np.r_[np.arange(1,6), np.arange(1,6)],
    'status': ['new','old']*5,
    'value': np.random.randint(1,100,10)
})
df

   id status  value
0   1    new     76
1   2    old     28
2   3    new      7
3   4    old      3
4   5    new      4
5   1    old     68
6   2    new     77
7   3    old     49
8   4    new     23
9   5    old     50

<details><summary><strong>Show Solution</strong></summary>

```python
latest = df.drop_duplicates('id', keep='first')
latest.pivot(index='id', columns='status', values='value')
```

</details>

## Question 14 — Monthly Sales Trend

Convert 'date' to datetime, extract month, then sum sales per month.

In [36]:
np.random.seed(13)
dates = pd.date_range('2025-01-01','2025-06-30', freq='D')
df = pd.DataFrame({
    'date': np.random.choice(dates, 100),
    'sales': np.random.randint(20,80,100)
})
df.head()

        date  sales
0 2025-03-24     29
1 2025-06-26     70
2 2025-03-16     68
3 2025-01-17     22
4 2025-04-09     38

<details><summary><strong>Show Solution</strong></summary>

```python
df['month'] = pd.to_datetime(df['date']).dt.to_period('M')
df.pivot_table(index='month', values='sales', aggfunc='sum')
```

</details>

## Question 15 — Sensor Readings Wide to Long

Melt to long form with columns timestamp, sensor, reading.

In [39]:
np.random.seed(14)
df = pd.DataFrame({
    'timestamp': pd.date_range('2025-07-15 00:00', periods=5, freq='h'),
    'sensorA': np.random.rand(5),
    'sensorB': np.random.rand(5)
})
df

            timestamp   sensorA   sensorB
0 2025-07-15 00:00:00  0.513943  0.957604
1 2025-07-15 01:00:00  0.773165  0.513117
2 2025-07-15 02:00:00  0.870428  0.318284
3 2025-07-15 03:00:00  0.008047  0.539200
4 2025-07-15 04:00:00  0.309736  0.221255

<details><summary><strong>Show Solution</strong></summary>

```python
df_long = df.melt(id_vars='timestamp', var_name='sensor', value_name='reading')
```

</details>

## Question 16 — Compute Conversion Rate

Pivot to compute **conversion rate** (mean of converted) per campaign.

In [41]:
np.random.seed(15)
df = pd.DataFrame({
    'campaign': np.random.choice(['Email','Ads'], 50),
    'converted': np.random.choice([0,1], 50)
})
df.head()

  campaign  converted
0    Email          0
1      Ads          0
2    Email          0
3      Ads          1
4      Ads          0

<details><summary><strong>Show Solution</strong></summary>

```python
df.pivot_table(index='campaign', values='converted', aggfunc='mean')
```

</details>

## Question 17 — Split Category/Subcategory

Separate cat_sub into cat and sub, then sum qty with cat rows and sub columns.

In [44]:
np.random.seed(16)
df = pd.DataFrame({
    'cat_sub': ['A_X','A_Y','B_X','B_Y']*5,
    'qty': np.random.randint(1,5,20)
})
df.head()

  cat_sub  qty
0     A_X    2
1     A_Y    3
2     B_X    2
3     B_Y    2
4     A_X    2

<details><summary><strong>Show Solution</strong></summary>

```python
df[['cat','sub']] = df['cat_sub'].str.split('_', expand=True)
df.pivot_table(index='cat', columns='sub', values='qty', aggfunc='sum')
```

</details>

## Question 18 — Ordered Categories in Pivot

Set 'priority' as categorical ordered low<medium<high, then count tickets per priority (rows).

In [47]:
np.random.seed(17)
df = pd.DataFrame({
    'priority': np.random.choice(['low','medium','high'], 30),
    'tickets': 1
})
df.head()

  priority  tickets
0   medium        1
1     high        1
2     high        1
3   medium        1
4      low        1

<details><summary><strong>Show Solution</strong></summary>

```python
df['priority'] = pd.Categorical(df['priority'], categories=['low','medium','high'], ordered=True)
df.pivot_table(index='priority', values='tickets', aggfunc='count').sort_index()
```

</details>

## Question 19 — Value Vars Melt Then Pivot

Melt height and weight into long, then compute average of each measure.

In [49]:
np.random.seed(18)
df = pd.DataFrame({
    'id': range(1,6),
    'height_cm': np.random.randint(150,190,5),
    'weight_kg': np.random.randint(50,90,5)
})
df

   id  height_cm  weight_kg
0   1        169         84
1   2        155         67
2   3        152         55
3   4        158         71
4   5        174         60

<details><summary><strong>Show Solution</strong></summary>

```python
long = df.melt(id_vars='id', var_name='measure', value_name='value')
long.pivot_table(index='measure', values='value', aggfunc='mean')
```

</details>

## Question 20 — Outlier Filter Then Multi‑Metric Pivot

Filter out profits > 180, then compute mean & std profit per branch.

In [51]:
np.random.seed(19)
df = pd.DataFrame({
    'branch': np.random.choice(['East','West'], 100),
    'profit': np.random.normal(100,20,100)
})
# add outliers
df.loc[np.random.choice(df.index, 5, replace=False),'profit'] += 200
df.head()

  branch      profit
0   West  108.309638
1   East   85.962477
2   West  103.709289
3   East  109.366996
4   East  100.790467

<details><summary><strong>Show Solution</strong></summary>

```python
clean = df[df['profit']<=180]
clean.pivot_table(index='branch', values='profit', aggfunc=['mean','std'])
```

</details>

## Question 21: End‑to‑End Tidy Data & Exploratory Analysis

**Objective:**  
Practice the full workflow of acquiring real data, cleaning it into tidy form, performing exploratory visualizations, and communicating your first impressions.

---

### 1. Data Acquisition

1. **Choose a dataset**  
   - Find any publicly‑available CSV file online (e.g. Kaggle, UCI Machine Learning Repository, data.gov).  
2. **Download the file**  
   - Save it into your project folder as `data/your_dataset.csv`.  
   - Note the source URL and a brief description (what it measures, number of rows, columns).

---

### 2. Loading & Initial Inspection

1. **Import pandas**  
   - import pandas as pd  
2. **Read the CSV**  
   - df = pd.read_csv("data/your_dataset.csv")  
3. **Peek at the data**  
   - df.head()  
   - df.info()  
   - df.describe()

---

### 3. Tidying the Data

Follow the tidy‑data principles: one variable per column, one observation per row, one value per cell.

1. **Identify issues**  
   - Are there multiple measures in one column?  
   - Are columns encoding two variables (e.g. `2019_sales` and `2020_sales`)?  
   - Are any column names unclear or inconsistent?  
2. **Reshape as needed**  
   - Melt wide → long: df_long = df.melt(id_vars=[…], var_name="variable", value_name="value")  
   - Pivot long → wide: df_wide = df_long.pivot(index=[…], columns="variable", values="value")  
3. **Rename & convert**  
   - Standardize column names.  
   - Convert data types: df["date"] = pd.to_datetime(df["date"]), df["category"] = df["category"].astype("category")  
4. **Handle missing or duplicate data**  
   - Drop or impute missing values as appropriate.  
   - Remove exact duplicate rows: df = df.drop_duplicates()

---

### 4. Exploratory Data Analysis (EDA)

Create at least **three** different plots to understand structure or patterns. Examples:

- **Univariate distribution:** histogram or density plot of a numeric variable  
- **Bivariate relationship:** scatterplot of two continuous variables; boxplot or violin plot grouped by category  
- **Time series or trend:** line plot over time (if applicable)  
- **Categorical counts (optional):** bar chart of categorical frequencies  

Be sure to label axes, add titles, and choose sensible figure sizes.

---

### 5. Insights & Interpretation

Write **1–2 clear sentences** describing the most interesting pattern(s).  
Examples:  
- “Sales peak in Q4 each year, suggesting a strong holiday effect.”  
- “Advertising spend and website visits show a strong positive correlation (r ≈ 0.7).”


Challenge: how can you ensure that any one is able to download this data and make sure they get the same exact answer as you?